app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Comentario de prueba"], ["commenter", "Carlos"], ["created_at", "2015-05-30 22:54:35.172925"], ["post_id", 1], ["updated_at", "2015-05-30 22:54:35.172925"]]
---
    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(params.require(:comment).permit(:commenter, :body))