app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-05-30 20:09:43.043478"], ["text", "prueba1"], ["title", "p1"], ["updated_at", "2015-05-30 20:09:43.043478"]]
---
    def create
        @post = Post.new(params.require(:post).permit(:title, :text))

        if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = 2  [["text", "prueba2"], ["title", "prub2"], ["updated_at", "2015-05-30 21:49:01.515433"]]
---
    def update
        @post = Post.find(params[:id])

        if @post.update_attributes(params.require(:post).permit(:title, :text))